#4. จงเขียนโปรแกรม Python ของโปรแกรมแก้สมการ y = 2x2+ 2x + 1 เมื่อ x คือค่าที่รับทางแป้นพิมพ์
#   และแสดงผลจากการแก้สมการ y ที่ได้ทางหน้าจอ

def showProgramName() :
    print('**--โปรแกรมแก้สมการ y = 2X2 + 2X + 1--**')
    
def inputData( ) :
    x = float(input('สมการ X : '))
    return x

def calequation(x):
    y = (( 2 * ( x * 2 )) + ( 2 * x ) + 1 )
    return y

def showequation ( x, y ) :
    print(f'y = ( 2 * ({x:.2f} * 2)) + (2 * {x:.2f}) + 1')
    print (f'แก้สมการได้ : {y:.2f}')

print('------------------------------------------------')
showProgramName()
print('------------------------------------------------')
x = inputData()
print('------------------------------------------------')
y = calequation (x)
print('------------------------------------------------')
showequation ( x, y )
print('------------------------------------------------')